КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_НастройкиОрганизацийДиадок/КонтурЛогистика_НастройкиОрганизацийДиадок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_НастройкиОрганизацийДиадок</name>
  <enumValues>
    <name>LogisticsApiKey</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытий</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДата</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДатаПЛ</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийСервисаФизическихЛицДата</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийПЛ</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнятьПоказанияГСМВЭПЛ</name>
    <comment>Проверка наличия показаний ГСМ на выезде и заезде в сервисе</comment>
  </enumValues>
  <enumValues>
    <name>ПодразделениеОтправительПутевогоЛиста</name>
    <comment>если отправитель = получателю в Диадоке</comment>
  </enumValues>
  <enumValues>
    <name>ПодразделениеПолучательПутевогоЛиста</name>
    <comment>если отправитель = получателю в Диадоке</comment>
  </enumValues>
  <enumValues>
    <name>ПодразделениеТрН</name>
  </enumValues>
  <enumValues>
    <name>РазрешитьВодителямВноситьПоказанияГСМ</name>
  </enumValues>
  <enumValues>
    <name>ЧитатьЛентуДиадок</name>
  </enumValues>
  <enumValues>
    <name>ЧитатьЛентуЛогистики</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДиадокДата</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДиадок</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Настройки/КонтурЛогистика_Настройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Настройки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Значение</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоДляРасширения</name>
    <comment>В расширениях до 8.3.20 запрещено использовать предопределенные. Будем использовать это поле.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗначений</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ВсеСправочникиУчетнойСистемы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_ЦентрПоддержкиСервер/Module.bsl
Функция СобратьТехническуюИнформацию() Экспорт
	
	СистемнаяИнформация  = Новый СистемнаяИнформация;
	Результат = Новый Соответствие;
	
	// Сведения об организациях 
	ПредставлениеОрганизаций = "";
	
	НашиОрганизации = Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеНашиОрганизации();
	Для Каждого Организация Из НашиОрганизации Цикл 
		
		АктуальностьЛентыСобытийДиадокДата = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЗначениеНастройки(
			Организация, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДиадокДата);
		
		ПредставлениеОрганизации = "ИНН/КПП: %1/%2, Дата границы синхр.: %3";
		ПредставлениеОрганизации = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ПредставлениеОрганизации, 
									Организация.ИНН, 
									Организация.КПП, 
									АктуальностьЛентыСобытийДиадокДата); 
				
		ПредставлениеОрганизаций = ПредставлениеОрганизаций + ?(ЗначениеЗаполнено(ПредставлениеОрганизаций), "; ", "") + ПредставлениеОрганизации;
		
	КонецЦикла;	
	
	Результат.Вставить("Сведения об организациях", ПредставлениеОрганизаций);
	
	// Сведения о подсистеме
	ПредставлениеПодсистемы = "Имя: Контур.Логистика, Синоним: Подсистема Контур.Логистика для 1С, Номер версии: %1 - %2";
	
	НомерВерсии = КонтурЛогистика_ОбновлениеВерсииМодуля.ТекущаяВерсияПодсистемыКонтурЛогистика();
	ТипВерсии = ?(ВерсияПубличная(НомерВерсии), "Публичный", "Не публичный");
	
	ПредставлениеПодсистемы = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ПредставлениеПодсистемы, 
									НомерВерсии, 
									ТипВерсии);
									
	Результат.Вставить("Сведения о подсистеме", ПредставлениеПодсистемы);									
									
	// Седения о конфигурации
	
	ПредставлениеКонфигурации = "Имя: %1, Синоним: %2, Номер версии: %3";
	
	ПредставлениеКонфигурации = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ПредставлениеКонфигурации, 
									Строка(Метаданные.Имя), 
									Строка(Метаданные.Синоним),
									Строка(Метаданные.Версия));
									
	Результат.Вставить("Сведения о конфигурации", ПредставлениеКонфигурации);								
	
	// Сведения о платформе
	ПредставлениеПлатформы  = "Платформа: %1, Режим совместимости: %2";  
	
	ПредставлениеПлатформы = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ПредставлениеПлатформы, 
									Строка(СистемнаяИнформация.ВерсияПриложения), 
									Строка(Метаданные.РежимСовместимости));	
									
	Результат.Вставить("Сведения о платформе", ПредставлениеПлатформы);
	
		
	Возврат Результат;
	
КонецФункции 

Функция ПолучитьДвоичныеДанныеНастроек() Экспорт 
	
	Результат = Неопределено;
	
	Попытка
		
		ФайлДляВыгрузки = ПолучитьИмяВременногоФайла("zip");
		
		КаталогВыгрузкиНастроек = СоздатьКаталог_Логистика(КаталогВременныхФайлов(), "ВыгрузкаНастроек");
		
		КаталогНастрокиКонвертацииДокументов 	= СоздатьКаталог_Логистика(КаталогВыгрузкиНастроек, "НастрокиКонвертацииДокументов");
		КаталогНастрокиКонвертацииСправочников 	= СоздатьКаталог_Логистика(КаталогВыгрузкиНастроек, "НастрокиКонвертацииСправочников");
		
		ЗаписьZipФайла = Новый ЗаписьZipФайла(ФайлДляВыгрузки);
		
		// запись общих настроек
		ИмяФайлаОбщихНастроек = ЗаписатьОбщиеНастройкиВФайлTXT(КаталогВыгрузкиНастроек);
		ЗаписьZipФайла.Добавить(ИмяФайлаОбщихНастроек);
		
		// запись настроек конвертации документов
		ЗаписатьНастройкиКонвертацииДокументовВФайлTXT(КаталогНастрокиКонвертацииДокументов);
		ЗаписьZipФайла.Добавить(КаталогНастрокиКонвертацииДокументов + "\", РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
		
		// запись настроек конвертации справочников 
		ЗаписатьНастройкиКонвертацииСправочниковВФайлTXT(КаталогНастрокиКонвертацииСправочников);
		ЗаписьZipФайла.Добавить(КаталогНастрокиКонвертацииСправочников + "\", РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
		
		ЗаписьZipФайла.Записать();
		
		Результат = Новый ДвоичныеДанные(ФайлДляВыгрузки);
		
		УдалитьФайлы_Логистика(ФайлДляВыгрузки);
		
	Исключение
		
		ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, "Не удалось выгрузить общие настройки " + ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьКаталог_Логистика(КаталогРодитель, ИмяКаталога)
	
	КаталогВыгрузки = СтрЗаменить(КаталогРодитель + "\" + ИмяКаталога, "\\", "\");
	
	КаталогНаДиске = Новый Файл(КаталогВыгрузки);
	Если НЕ КаталогНаДиске.Существует() Тогда     
		СоздатьКаталог(КаталогВыгрузки);   
	КонецЕсли; 
	
	Возврат КаталогВыгрузки;
	
КонецФункции	

Функция ВерсияПубличная(НомерВерсии)

	Возврат Не Прав(НомерВерсии, 1) = 0;
	
КонецФункции

Процедура УдалитьФайлы_Логистика(Путь)
	
	ФайловыйОбъект = Новый Файл(Путь);
	
	Если ФайловыйОбъект.Существует() Тогда
		Попытка
			УдалитьФайлы(Путь);
		Исключение
			ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Предупреждение,,, "Не удалось удалить файлы - " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаписатьОбщиеНастройкиВФайлTXT(КаталогВыгрузкиНастроек)
	
	ТаблицаОбщихНастроек = ПолучитьТаблицуОбщихНастроек();
	
	ИмяФайлаОбщихНастроек = КаталогВыгрузкиНастроек + "\" + "Общие настройки.txt";
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайлаОбщихНастроек);
	
	ЗаписьТекста.ЗаписатьСтроку(Врег("Имя для Разработчиков - Название настройки - Значение - Путь - Описание - Удалена"));
	ЗаписьТекста.ЗаписатьСтроку("");
	
	Для Каждого СтрокаНастроек Из ТаблицаОбщихНастроек Цикл
		
		Шаблон = "%1 - %2 - %3 - %4 - %5 - %6";
		
		СтрокаИнформации = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(Шаблон, 
								СтрокаНастроек.ИмяПредопределенногоДляРасширения,
								СтрокаНастроек.Наименование,
								Строка(СтрокаНастроек.Значение),
								СтрокаНастроек.Ссылка.ПолноеНаименование(),
								СтрокаНастроек.Описание,
								ВРег(Строка(СтрокаНастроек.ПометкаУдаления)));
		
		ЗаписьТекста.ЗаписатьСтроку(СтрокаИнформации);
				
	КонецЦикла;
	
	ЗаписьТекста.Закрыть();
	
	Возврат ИмяФайлаОбщихНастроек;
	
КонецФункции

Функция ЗаписатьНастройкиКонвертацииДокументовВФайлTXT(КаталогВыгрузкиНастроек)
	
	НастройкиКонвертации = ПолучитьНастройкиКонвертацииДокументов();
	
	Соответствие = Новый Соответствие;
	
	//ИняФайлаНастроекКонвертацииДокументов = КаталогВыгрузкиНастроек + "\" + "Настройки конветрации документов.txt";
	//ЗаписьТекста = Новый ЗаписьТекста(ИняФайлаНастроекКонвертацииДокументов);
	
	Пока НастройкиКонвертации.Следующий() Цикл 
		
		Шаблон = "Конвертация в документ Логистики: %1 из документа Учетной системы: %2";
		
		ИмяФайлаБезРасширения = "Конвертация в документ Логистики: " + НастройкиКонвертации.ТипДокументаЛогистика + " ИЗ ";
		ИмяФайлаБезРасширения = ИмяФайлаБезРасширения + ?(ЗначениеЗаполнено(НастройкиКонвертации.ТипДокумента1С), "документа Учетной системы: " + НастройкиКонвертации.ТипДокумента1С, "Предыдущего титула");
		
		Соответствие.Вставить(Строка(НастройкиКонвертации.Ссылка.УникальныйИдентификатор()), ИмяФайлаБезРасширения);
		
		ИняФайлаНастройки = КаталогВыгрузкиНастроек + "\" + Строка(НастройкиКонвертации.Ссылка.УникальныйИдентификатор()) + ".txt";
		ЗаписьТекста = Новый ЗаписьТекста(ИняФайлаНастройки);
		
		ЗаписьТекста.ЗаписатьСтроку(ИмяФайлаБезРасширения + " - " + Строка(НастройкиКонвертации.Ссылка.УникальныйИдентификатор()));
		ЗаписьТекста.ЗаписатьСтроку(Символы.ПС);
		ЗаписьТекста.ЗаписатьСтроку("Наименование: " 			+ НастройкиКонвертации.Наименование);
		ЗаписьТекста.ЗаписатьСтроку("ТипДокументаЛогистика: " 	+ НастройкиКонвертации.ТипДокументаЛогистика);
		ЗаписьТекста.ЗаписатьСтроку("ТипДокумента1С: " 			+ НастройкиКонвертации.ТипДокумента1С);
		ЗаписьТекста.ЗаписатьСтроку("Удалена: " 				+ Строка(НастройкиКонвертации.ПометкаУдаления));
		ЗаписьТекста.ЗаписатьСтроку(Символы.ПС);
		
		ЗаписьТекста.ЗаписатьСтроку("ПРАВИЛА КОНВЕРТАЦИИ ГЛАВНОГО ДОКУМЕНТА");
		ЗаписьТекста.ЗаписатьСтроку(Символы.ПС);
		
		ПравилаКонвертацииГлавногоДокумента = НастройкиКонвертации.ПравилаКонвертацииГлавногоДокумента.Выбрать();
		Пока ПравилаКонвертацииГлавногоДокумента.Следующий() Цикл 
			
			ЗаписьТекста.ЗаписатьСтроку("РеквизитТитула: " 				+ ПравилаКонвертацииГлавногоДокумента.РеквизитТитула);
			ЗаписьТекста.ЗаписатьСтроку("РеквизитТитулаТипЗначения: " 	+ ПравилаКонвертацииГлавногоДокумента.РеквизитТитулаТипЗначения);
			ЗаписьТекста.ЗаписатьСтроку("РеквизитТитулаКомментарий: " 	+ ПравилаКонвертацииГлавногоДокумента.РеквизитТитулаКомментарий);
			ЗаписьТекста.ЗаписатьСтроку("СпособМаппинга: " 				+ ПравилаКонвертацииГлавногоДокумента.СпособМаппинга);
			ЗаписьТекста.ЗаписатьСтроку("ВыражениеВычисления: " 		+ ПравилаКонвертацииГлавногоДокумента.ВыражениеВычисления);
			ЗаписьТекста.ЗаписатьСтроку("СпособКонвертацииЗначения: " 	+ ПравилаКонвертацииГлавногоДокумента.СпособКонвертацииЗначения);
			ЗаписьТекста.ЗаписатьСтроку(Символы.ПС);
			
		КонецЦикла;
		
		ЗаписьТекста.ЗаписатьСтроку("ПРАВИЛА КОНВЕРТАЦИИ РЕКВИЗИТОВ ТИТУЛА");
		ЗаписьТекста.ЗаписатьСтроку(Символы.ПС);
		
		ПравилаКонвертацииТитулаРеквизиты = НастройкиКонвертации.ПравилаКонвертацииТитулаРеквизиты.Выбрать();
		Пока ПравилаКонвертацииТитулаРеквизиты.Следующий() Цикл 
			
			ЗаписьТекста.ЗаписатьСтроку("РеквизитТитула: " 				+ ПравилаКонвертацииТитулаРеквизиты.РеквизитТитула);
			ЗаписьТекста.ЗаписатьСтроку("РеквизитТитулаТипЗначения: " 	+ ПравилаКонвертацииТитулаРеквизиты.РеквизитТитулаТипЗначения);
			ЗаписьТекста.ЗаписатьСтроку("РеквизитТитулаКомментарий: " 	+ ПравилаКонвертацииТитулаРеквизиты.РеквизитТитулаКомментарий);
			ЗаписьТекста.ЗаписатьСтроку("СпособМаппинга: " 				+ ПравилаКонвертацииТитулаРеквизиты.СпособМаппинга);
			ЗаписьТекста.ЗаписатьСтроку("ВыражениеВычисления: " 		+ ПравилаКонвертацииТитулаРеквизиты.ВыражениеВычисления);
			ЗаписьТекста.ЗаписатьСтроку("СпособКонвертацииЗначения: " 	+ ПравилаКонвертацииТитулаРеквизиты.СпособКонвертацииЗначения);
			ЗаписьТекста.ЗаписатьСтроку(Символы.ПС);
			
		КонецЦикла;
		
		ЗаписьТекста.ЗаписатьСтроку("ПРАВИЛА КОНВЕРТАЦИИ ТАБЛИЧНОЙ ЧАСТИ ТОВАРЫ");
		ЗаписьТекста.ЗаписатьСтроку(Символы.ПС);
		
		ПравилаКонвертацииТитулаТабЧастьТовары = НастройкиКонвертации.ПравилаКонвертацииТитулаТабЧастьТовары.Выбрать();
		Пока ПравилаКонвертацииТитулаТабЧастьТовары.Следующий() Цикл 
			
			ЗаписьТекста.ЗаписатьСтроку("РеквизитТитула: " 				+ ПравилаКонвертацииТитулаТабЧастьТовары.РеквизитТитула);
			ЗаписьТекста.ЗаписатьСтроку("РеквизитТитулаТипЗначения: " 	+ ПравилаКонвертацииТитулаТабЧастьТовары.РеквизитТитулаТипЗначения);
			ЗаписьТекста.ЗаписатьСтроку("РеквизитТитулаКомментарий: " 	+ ПравилаКонвертацииТитулаТабЧастьТовары.РеквизитТитулаКомментарий);
			ЗаписьТекста.ЗаписатьСтроку("СпособМаппинга: " 				+ ПравилаКонвертацииТитулаТабЧастьТовары.СпособМаппинга);
			ЗаписьТекста.ЗаписатьСтроку("ВыражениеВычисления: " 		+ ПравилаКонвертацииТитулаТабЧастьТовары.ВыражениеВычисления);
			ЗаписьТекста.ЗаписатьСтроку("СпособКонвертацииЗначения: " 	+ ПравилаКонвертацииТитулаТабЧастьТовары.СпособКонвертацииЗначения);
			ЗаписьТекста.ЗаписатьСтроку(Символы.ПС);
			
		КонецЦикла;
		
		ЗаписьТекста.Закрыть();
		
		// XML
		Запись = Новый ЗаписьXML;
		Запись.УстановитьСтроку();
		Объект = НастройкиКонвертации.Ссылка.ПолучитьОбъект();
		СериализаторXDTO.ЗаписатьXML(Запись, Объект);
		СтрокаXML =  Запись.Закрыть();		
		
		ПолноеИмяФайла = КаталогВыгрузкиНастроек + "\" + Строка(НастройкиКонвертации.Ссылка.УникальныйИдентификатор()) + ".xml";
		ТД = Новый ТекстовыйДокумент;
		ТД.УстановитьТекст(СтрокаXML);
		ТД.Записать(ПолноеИмяФайла,"UTF-8");
	
	КонецЦикла;	
	
	ИняФайлаСпискаНастроек = КаталогВыгрузкиНастроек + "\" + "Список настроек конветрации документов.txt";
	ЗаписьТекста = Новый ЗаписьТекста(ИняФайлаСпискаНастроек);
	
	Для Каждого КлючЗначение Из Соответствие Цикл 
		
		ЗаписьТекста.ЗаписатьСтроку(КлючЗначение.Значение + " - " + КлючЗначение.Ключ);
		
	КонецЦикла;	
	
	ЗаписьТекста.Закрыть();
		
КонецФункции

Функция ЗаписатьНастройкиКонвертацииСправочниковВФайлTXT(КаталогВыгрузкиНастроек)
	
	НастройкиКонвертации = ПолучитьТаблицуНастроекКонвертацииСправочников();
	
	Соответствие = Новый Соответствие;
		
	Пока НастройкиКонвертации.Следующий() Цикл 
		
		Шаблон = "Конвертация В справочник Логистики: %1 ИЗ Справочника/документа Учетной системы: %2 И Документа основания Ученой Системы: %3 ДЛЯ реквизита: %4";
		
		СтрокаИнформации = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(Шаблон, 
								НастройкиКонвертации.ТипСправочникаЛогистика,
								НастройкиКонвертации.ТипСправочникаИлиДокументаУС,
								?(ЗначениеЗаполнено(НастройкиКонвертации.ТипДокументаОснования), НастройкиКонвертации.ТипДокументаОснования, "Не указан"),
								?(ЗначениеЗаполнено(НастройкиКонвертации.РеквизитТитула), НастройкиКонвертации.РеквизитТитула, "Не указан"));
		
		Соответствие.Вставить(Строка(НастройкиКонвертации.Ссылка.УникальныйИдентификатор()), СтрокаИнформации);
		
		ИняФайлаНастройки = КаталогВыгрузкиНастроек + "\" + Строка(НастройкиКонвертации.Ссылка.УникальныйИдентификатор()) + ".txt";
		ЗаписьТекста = Новый ЗаписьТекста(ИняФайлаНастройки);
		
		ЗаписьТекста.ЗаписатьСтроку(СтрокаИнформации + " - " + Строка(НастройкиКонвертации.Ссылка.УникальныйИдентификатор()));
		ЗаписьТекста.ЗаписатьСтроку(Символы.ПС);
		ЗаписьТекста.ЗаписатьСтроку("Наименование: " 						+ НастройкиКонвертации.Наименование);
		ЗаписьТекста.ЗаписатьСтроку("ТипСправочникаЛогистика: " 			+ НастройкиКонвертации.ТипСправочникаЛогистика);
		ЗаписьТекста.ЗаписатьСтроку("ТипСправочникаИлиДокументаУС: " 		+ НастройкиКонвертации.ТипСправочникаИлиДокументаУС);
		ЗаписьТекста.ЗаписатьСтроку("ТипДокументаОснования: " 				+ НастройкиКонвертации.ТипДокументаОснования);
		ЗаписьТекста.ЗаписатьСтроку("РеквизитТитула: " 						+ НастройкиКонвертации.РеквизитТитула);
		ЗаписьТекста.ЗаписатьСтроку("ОбновлятьРеквизитыИзУчетнойСистемы: " 	+ Строка(НастройкиКонвертации.ОбновлятьРеквизитыИзУчетнойСистемы));
		ЗаписьТекста.ЗаписатьСтроку("Удалена: " 							+ Строка(НастройкиКонвертации.ПометкаУдаления));
		ЗаписьТекста.ЗаписатьСтроку(Символы.ПС);
		
		ЗаписьТекста.ЗаписатьСтроку("ПРАВИЛА КОНВЕРТАЦИИ");
		ЗаписьТекста.ЗаписатьСтроку(Символы.ПС);
		
		ПравилаКонвертации = НастройкиКонвертации.ПравилаКонвертации.Выбрать();
		Пока ПравилаКонвертации.Следующий() Цикл 
			
			ЗаписьТекста.ЗаписатьСтроку("РеквизитСправочникаЛогистика: " 			+ ПравилаКонвертации.РеквизитСправочникаЛогистика);
			ЗаписьТекста.ЗаписатьСтроку("РеквизитСправочникаЛогистикаТипЗначения: " + ПравилаКонвертации.РеквизитСправочникаЛогистикаТипЗначения);
			ЗаписьТекста.ЗаписатьСтроку("РеквизитСправочникаЛогистикаКомментарий: " + ПравилаКонвертации.РеквизитСправочникаЛогистикаКомментарий);
			ЗаписьТекста.ЗаписатьСтроку("СпособМаппинга: " 							+ ПравилаКонвертации.СпособМаппинга);
			ЗаписьТекста.ЗаписатьСтроку("ВыражениеВычисления: " 					+ ПравилаКонвертации.ВыражениеВычисления);
			ЗаписьТекста.ЗаписатьСтроку("СпособКонвертацииЗначения: " 				+ ПравилаКонвертации.СпособКонвертацииЗначения);
			ЗаписьТекста.ЗаписатьСтроку("ОбновитьИзУчетнойСистемы: " 				+ Строка(ПравилаКонвертации.ОбновитьИзУчетнойСистемы));
			ЗаписьТекста.ЗаписатьСтроку(Символы.ПС);
			
		КонецЦикла;
		
		ЗаписьТекста.ЗаписатьСтроку("ПРАВИЛА КОНВЕРТАЦИИ ТАБЛИЦЫ СООТВЕТСТВИЙ");
		ЗаписьТекста.ЗаписатьСтроку(Символы.ПС);
		
		ТаблицаСоответствий = НастройкиКонвертации.ТаблицаСоответствий.Выбрать();
		Пока ТаблицаСоответствий.Следующий() Цикл 
			
			ЗаписьТекста.ЗаписатьСтроку("РеквизитСправочникаЛогистика: "+ ТаблицаСоответствий.РеквизитСправочникаЛогистика);
			ЗаписьТекста.ЗаписатьСтроку("ИзвлеченноеЗначение: " 		+ ТаблицаСоответствий.ИзвлеченноеЗначение);
			ЗаписьТекста.ЗаписатьСтроку("СпособМаппинга: " 				+ ТаблицаСоответствий.СпособМаппинга);
			ЗаписьТекста.ЗаписатьСтроку("ВыражениеВычисления: " 		+ ТаблицаСоответствий.ВыражениеВычисления);
			ЗаписьТекста.ЗаписатьСтроку(Символы.ПС);
			
		КонецЦикла;
				
		ЗаписьТекста.Закрыть();
		
		// XML
		Запись = Новый ЗаписьXML;
		Запись.УстановитьСтроку();
		Объект = НастройкиКонвертации.Ссылка.ПолучитьОбъект();
		СериализаторXDTO.ЗаписатьXML(Запись, Объект);
		СтрокаXML =  Запись.Закрыть();		
		
		ПолноеИмяФайла = КаталогВыгрузкиНастроек + "\" + Строка(НастройкиКонвертации.Ссылка.УникальныйИдентификатор()) + ".xml";
		ТД = Новый ТекстовыйДокумент;
		ТД.УстановитьТекст(СтрокаXML);
		ТД.Записать(ПолноеИмяФайла,"UTF-8");
		
	КонецЦикла;	
	
	ИняФайлаСпискаНастроек = КаталогВыгрузкиНастроек + "\" + "Список настроек конветрации справочников.txt";
	ЗаписьТекста = Новый ЗаписьТекста(ИняФайлаСпискаНастроек);
	
	Для Каждого КлючЗначение Из Соответствие Цикл 
		
		ЗаписьТекста.ЗаписатьСтроку(КлючЗначение.Значение + " - " + КлючЗначение.Ключ);
		
	КонецЦикла;	
	
	ЗаписьТекста.Закрыть();
		
КонецФункции

Функция ПолучитьТаблицуОбщихНастроек()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_Настройки.Ссылка КАК Ссылка,
	|	КонтурЛогистика_Настройки.Наименование КАК Наименование,
	|	КонтурЛогистика_Настройки.Значение КАК Значение,
	|	КонтурЛогистика_Настройки.Описание КАК Описание,
	|	КонтурЛогистика_Настройки.ПометкаУдаления КАК ПометкаУдаления,
	|	КонтурЛогистика_Настройки.ИмяПредопределенногоДляРасширения КАК ИмяПредопределенногоДляРасширения
	|ИЗ
	|	Справочник.КонтурЛогистика_Настройки КАК КонтурЛогистика_Настройки
	|ГДЕ
	|	НЕ КонтурЛогистика_Настройки.ЭтоГруппа
	|	И КонтурЛогистика_Настройки.ИмяПредопределенногоДляРасширения <> ""ПарольАвторизацииДиадокАПИ""
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

Функция ПолучитьНастройкиКонвертацииДокументов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииДокументов.Ссылка КАК Ссылка,
	|	КонтурЛогистика_НастройкиКонвертацииДокументов.Наименование КАК Наименование,
	|	КонтурЛогистика_НастройкиКонвертацииДокументов.ТипДокументаЛогистика КАК ТипДокументаЛогистика,
	|	КонтурЛогистика_НастройкиКонвертацииДокументов.ТипДокумента1С КАК ТипДокумента1С,
	|	КонтурЛогистика_НастройкиКонвертацииДокументов.ПравилаКонвертацииГлавногоДокумента.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Картинка КАК Картинка,
	|		РеквизитТитула КАК РеквизитТитула,
	|		РеквизитТитулаТипЗначения КАК РеквизитТитулаТипЗначения,
	|		РеквизитТитулаКомментарий КАК РеквизитТитулаКомментарий,
	|		СпособМаппинга КАК СпособМаппинга,
	|		ВыражениеВычисления КАК ВыражениеВычисления,
	|		КлючДопСвойстваРеквизита КАК КлючДопСвойстваРеквизита,
	|		ВыражениеВычисления2 КАК ВыражениеВычисления2,
	|		СпособКонвертацииЗначения КАК СпособКонвертацииЗначения
	|	) КАК ПравилаКонвертацииГлавногоДокумента,
	|	КонтурЛогистика_НастройкиКонвертацииДокументов.ПравилаКонвертацииТитулаРеквизиты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Картинка КАК Картинка,
	|		РеквизитТитула КАК РеквизитТитула,
	|		РеквизитТитулаТипЗначения КАК РеквизитТитулаТипЗначения,
	|		РеквизитТитулаКомментарий КАК РеквизитТитулаКомментарий,
	|		СпособМаппинга КАК СпособМаппинга,
	|		ВыражениеВычисления КАК ВыражениеВычисления,
	|		КлючДопСвойстваРеквизита КАК КлючДопСвойстваРеквизита,
	|		ВыражениеВычисления2 КАК ВыражениеВычисления2,
	|		СпособКонвертацииЗначения КАК СпособКонвертацииЗначения
	|	) КАК ПравилаКонвертацииТитулаРеквизиты,
	|	КонтурЛогистика_НастройкиКонвертацииДокументов.ПравилаКонвертацииТитулаТабЧастьТовары.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Картинка КАК Картинка,
	|		РеквизитТитула КАК РеквизитТитула,
	|		РеквизитТитулаТипЗначения КАК РеквизитТитулаТипЗначения,
	|		РеквизитТитулаКомментарий КАК РеквизитТитулаКомментарий,
	|		ДоступноЗаполнениеИзБазовогоСоответствия КАК ДоступноЗаполнениеИзБазовогоСоответствия,
	|		СпособМаппинга КАК СпособМаппинга,
	|		ВыражениеВычисления КАК ВыражениеВычисления,
	|		КлючДопСвойстваРеквизита КАК КлючДопСвойстваРеквизита,
	|		ВыражениеВычисления2 КАК ВыражениеВычисления2,
	|		СпособКонвертацииЗначения КАК СпособКонвертацииЗначения
	|	) КАК ПравилаКонвертацииТитулаТабЧастьТовары,
	|	КонтурЛогистика_НастройкиКонвертацииДокументов.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов КАК КонтурЛогистика_НастройкиКонвертацииДокументов";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции 

Функция ПолучитьТаблицуНастроекКонвертацииСправочников()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.Наименование КАК Наименование,
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.ТипСправочникаИлиДокументаУС КАК ТипСправочникаИлиДокументаУС,
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.ТипСправочникаЛогистика КАК ТипСправочникаЛогистика,
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.ТипДокументаОснования КАК ТипДокументаОснования,
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.РеквизитТитула КАК РеквизитТитула,
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.ОбновлятьРеквизитыИзУчетнойСистемы КАК ОбновлятьРеквизитыИзУчетнойСистемы,
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.ПравилаКонвертации.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Картинка КАК Картинка,
	|		РеквизитСправочникаЛогистика КАК РеквизитСправочникаЛогистика,
	|		РеквизитСправочникаЛогистикаПредставление КАК РеквизитСправочникаЛогистикаПредставление,
	|		РеквизитСправочникаЛогистикаТипЗначения КАК РеквизитСправочникаЛогистикаТипЗначения,
	|		РеквизитСправочникаЛогистикаКомментарий КАК РеквизитСправочникаЛогистикаКомментарий,
	|		СпособМаппинга КАК СпособМаппинга,
	|		ВыражениеВычисления КАК ВыражениеВычисления,
	|		КлючДопСвойстваРеквизита КАК КлючДопСвойстваРеквизита,
	|		ВыражениеВычисления2 КАК ВыражениеВычисления2,
	|		СпособКонвертацииЗначения КАК СпособКонвертацииЗначения,
	|		ОбновитьИзУчетнойСистемы КАК ОбновитьИзУчетнойСистемы
	|	) КАК ПравилаКонвертации,
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.ТаблицаСоответствий.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		РеквизитСправочникаЛогистика КАК РеквизитСправочникаЛогистика,
	|		ИзвлеченноеЗначение КАК ИзвлеченноеЗначение,
	|		СпособМаппинга КАК СпособМаппинга,
	|		ВыражениеВычисления КАК ВыражениеВычисления
	|	) КАК ТаблицаСоответствий,
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.ПометкаУдаления КАК ПометкаУдаления,
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников КАК КонтурЛогистика_НастройкиКонвертацииСправочников";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции
